# 4. Написати sql запит, який буде робити те саме, що і в завданні 3, але виводити дані відсортовані по
# кількості користувачів у спадаючому порядку та по віку у зростаючому порядку. Результатом має бути таблиця:
#     age  | users
#     52    | 2
#     120  | 2
#     32    | 1
#     1142 | 1
#
#
#
# Якщо результатом має бути таблиця в завданні, то треба зробити додатковe фільтрування, щоб не виводились
# роки < 30 (цього в завданні не написано, але я орієнтуюсь на вихідну таблицю)
# SQL запит:

# SELECT age, COUNT (id) AS users
# FROM users
# WHERE age > 30
# GROUP BY age
# ORDER BY users DESC, age;