# 5. (необов'язкове виконання) Модифікувати попередній запит таким чином, щоб з отриманого результату вибрати
# тільки ті записи, де значення users більше 1. Результатом має бути таблиця:
#     age  | users
#     52    | 2
#     120  | 2
#
#
#
# Якщо результатом має бути таблиця в завданні, то треба зробити додатковe фільтрування, щоб не виводились
# роки < 30 (цього в завданні не написано, але я орієнтуюсь на вихідну таблицю)
# SQL запит:
#
# SELECT age, COUNT (id) AS users
# FROM users
# WHERE age > 30
# GROUP BY age
# HAVING users > 1
# ORDER BY users DESC, age;